cask_args appdir: '/Applications'

# install commandline utils
brew 'ag'
brew 'antigen'
brew 'gh'
brew 'go'
brew 'grc'
brew 'mongodb-community'
brew 'mongodb-database-tools'
brew 'mongosh'
brew 'the_silver_searcher'
brew 'vim'
brew 'wget'

# install apps
cask 'authy'
cask 'brave-browser'
cask 'dropbox'
cask 'figma'
cask 'firefox'
cask 'iterm2'
cask 'mongodb-compass'
cask 'notion'
cask 'rescuetime'
cask 'slack'
cask 'spotify'
cask 'sublime-text'
cask 'visual-studio-code'
cask 'zoom'
