cask_args appdir: '/Applications'

tap 'mongodb/brew'

# install commandline utils
brew 'antigen'
brew 'fzf'
brew 'gh'
brew 'go'
brew 'grc'
brew 'gpg'
brew 'mongodb-community'
brew 'pyenv'
brew 'the_silver_searcher'
brew 'vim'
brew 'wget'

# install apps
cask 'aws-vault'
cask 'brave-browser'
cask 'dropbox'
cask 'figma'
cask 'firefox'
cask 'iterm2'
cask 'mongodb-compass'
cask 'notion'
cask 'spotify'
cask 'sublime-text'
cask 'visual-studio-code'
