cask_args appdir: '/Applications'

# install commandline utils
brew 'antigen'
brew 'coreutils'
brew 'fzf'
brew 'grc'
brew 'node'
brew 'reattach-to-user-namespace'
brew 'tmux'
brew 'vim'
brew 'wget'

# install apps
cask '1password'
cask 'cleanmymac'
cask 'docker'
cask 'dropbox'
cask 'figma'
cask 'flux'
cask 'google-chrome'
cask 'keybase'
cask 'rescuetime'
cask 'selfcontrol'
cask 'simplenote'
cask 'slack'
cask 'spotify'
cask 'sublime-text'
